import java.util.Random;
// класс отвечаюзий за создание случайных людей
public class HumanGenerator {
    //поле массив имен разделенны пробелом

    String names[] = {
            "Савин Лев",
            "Горшкова Агния",
            "Фокин Артемий",
            "Селезнев Фёдор",
            "Александров Савелий",
            "Анисимов Даниил",
            "Назарова Екатерина",
            "Коновалов Лев",
            "Колесникова Анна",
            "Попов Максим",
            "Рябов Родион",
            "Семина Анастасия",
            "Яковлева Вероника",
            "Астахов Юрий",
            "Ефремова Кристина",
            "Родионова Анна",
            "Григорьева Александра",
            "Попов Илья",
            "Соколова Елизавета",
            "Филиппов Павел",
            "Розанова Арина",
            "Семенова Диана",
            "Носова Елизавета",
            "Васильев Тимур",
            "Касаткин Дмитрий",
            "Воронкова Варвара",
            "Устинов Андрей",
            "Афанасьев Алексей",
            "Белова Дарья",
            "Сухарева Альбина",
            "Муратова Евгения",
            "Жуков Григорий",
            "Ермакова Анна",
            "Филатов Илья",
            "Столярова Ариана",
            "Евдокимова Арина",
            "Романова Валерия",
            "Цветков Иван",
            "Александрова Мария",
            "Иванова Алина",
            "Трошина Милана",
            "Иванова Алия",
            "Михеев Артём",
            "Михайлова Есения",
            "Давыдова Арина",
            "Ершова Ксения",
            "Савельев Юрий",
            "Моисеева Мария",
            "Петрова Алина",
            "Кузнецова Таисия",
            "Шевцова Варвара",
            "Ершов Илья",
            "Жданов Александр",
            "Буров Даниил",
            "Макаров Даниил",
            "Березин Александр",
            "Кудрявцев Герман",
            "Куликов Денис",
            "Комаров Али",
            "Родина Вероника",
            "Павлов Алексей",
            "Кузьмина Евгения",
            "Степанова Таисия",
            "Дмитриев Иван",
            "Никольский Даниил",
            "Потапов Иван",
            "Вдовина Алия",
            "Дегтярева Ева",
            "Баженова Агата",
            "Грачев Тихон",
            "Филиппов Макар",
            "Захаров Тимофей",
            "Наумова Анна",
            "Куликов Мирон",
            "Долгов Андрей",
            "Демин Камиль",
            "Малышев Артём",
            "Соловьева Ева",
            "Щербакова Татьяна",
            "Давыдов Эмиль",
            "Денисов Артём",
            "Алексеева Варвара",
            "Герасимов Артём",
            "Антонова София",
            "Горшков Максим",
            "Платонов Александр",
            "Белова Елена",
            "Соколова Ангелина",
            "Александрова Анна",
            "Кулешов Александр",
            "Панкратов Егор",
            "Семин Александр",
            "Павлов Иван",
            "Соколова Мия",
            "Кулакова Милана",
            "Дмитриев Андрей",
            "Львов Арсений",
            "Новиков Мирон",
            "Петров Леонид",
            "Иванова Варвара",

    };
    // поля,которые будут содержать отдельно имена и фамилии
    String firstNames[];
    String lastNames[];
    // конструктор ,вызывается при создании обьекта humanGenerator
    HumanGenerator(){
        //  выделяем память под массив  имен и фамилий
        this.firstNames = new String[names.length];
        this.lastNames= new String[names.length];
        //заполняем память под массивы  имен и фамилий
        for (int i = 0; i < names.length; i++) {
            // разделяем фамилии и имена по пробелу на  два элемента и кладем нулевой в фамилию
            lastNames[i] = names[i].split(" ")[0];
            firstNames[i] = names[i].split(" ")[1];
        }
    }
    //  метод отвечающий за генерацию случайных людей в количестве count
    Human[] generate(int count) {

        // обьявляем генератор случайных чисел
        Random random = new Random();
        //создаем массив людей требуемого размера
        Human humans[] = new Human[count];
        // заполняем массив людей
        for (int i = 0; i < humans.length; i++) {
            //создаем человека
            Human newHuman = new Human();
            // даем ему случайное имя и случайную фамилию
            newHuman.firstName = firstNames[random.nextInt(firstNames.length)];
            newHuman.lastName = lastNames[random.nextInt(lastNames.length)];
            // человека положили в массив
            newHuman.setAge(random.nextInt(100));
            // newHuman.age = random.nextInt(100);
            humans[i] = newHuman;
        }
        // вернули список людей
        return humans;
    }
}

